In [5]:
import pandas as pd
import numpy as np

In [ ]:
# 1. Convert the list of 26 letters (a-z or A-Z) of the alphabet to the index of the DataFrame, 
# and assign 26 random integer numbers. Print out the first 5 rows.      [6 points]

In [3]:
import string

index = [chr(i) for i in range(ord('a'), ord('z')+1)]
df = pd.DataFrame(np.random.randint(0, 100, size=(26,1)), index=index, columns=['Values'])
print(df.iloc[:5])

   Values
a      35
b      92
c      79
d      27
e      86

In [ ]:
#2. Construct the following DataFrame and print it out.  [4 points]

In [6]:
df = pd.DataFrame({
        'class1': [1, 2, 3, 4, 7, 11],
        'class2': [4, 5, 6, 9, 5, 0],
        'class3': [7, 5, 8, 12, 1, 11]
                })

print(df)

   class1  class2  class3
0       1       4       7
1       2       5       5
2       3       6       8
3       4       9      12
4       7       5       1
5      11       0      11

In [9]:
#Use "iloc" to convert the first column of this DataFrame as a Series.   
ser = df.iloc[:, 0]
series = pd.Series(ser)
print(series)

0     1
1     2
2     3
3     4
4     7
5    11
Name: class1, dtype: int64

In [ ]:
#3. Work on the above data (Question 2), implement the following tasks using indexers loc and/or iloc:      [6 points]

In [ ]:
#(1) Select all columns, except one given column 'class3', and print out the result.

In [18]:
df.loc[:, :'class2']

   class1  class2
0       1       4
1       2       5
2       3       6
3       4       9
4       7       5
5      11       0

In [ ]:
#(2) Remove first 3 rows of the DataFrame and print it out.

In [19]:
df.iloc[3:, :]

   class1  class2  class3
3       4       9      12
4       7       5       1
5      11       0      11

In [ ]:
#(3) Remove last 3 rows of the DataFrame and print it out.

In [22]:
df.iloc[:-3, :]

   class1  class2  class3
0       1       4       7
1       2       5       5
2       3       6       8

In [ ]:
# 4. Compute the Euclidean distance between two series (points) p1 and p2.    [4 points]

In [43]:
p1 = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
p2 = pd.Series([8, 9, 10, 11, 12, 7, 6, 5, 4, 3])

distance = sum((p1 - p2)**2)**0.5
print(distance)

18.16590212458495

In [ ]:
# 5. (1) Create a DataFrame df: the name of 4 columns is wxyz respectively, 
#    the name of 10 indexes is abcdefghij respectively. 
#    The values are randomly distributed in [1,100) and the seed is set as 100.     [4 points]

In [13]:
np.random.seed(100)
data = np.random.randint(1, 100, size=(10, 4))
df = pd.DataFrame(data, index=list('abcdefghij'), columns=list('wxyz'))
print(df)

    w   x   y   z
a   9  25  68  88
b  80  49  11  95
c  53  99  54  67
d  99  15  35  25
e  16  61  59  17
f  10  94  87   3
g  28   5  32   2
h  14  84   5  92
i  60  68   8  50
j  48  66  62  15

In [ ]:
#(2) Create a new column such that, each row of this df contains the row number of nearest row-record 
# by Euclidean distance.     [8 points]

In [23]:
np.random.seed(100)
data = np.random.randint(1, 100, size=(10, 4))
df = pd.DataFrame(data, index=list('abcdefghij'), columns=list('wxyz'))

dis = np.sqrt(np.sum(np.square(df.values[:, np.newaxis, :] - df.values), axis=-1))
np.fill_diagonal(dis, np.inf)
nearest_rows = df.index[np.argmin(dis, axis=1)]
df['nearest_row'] = nearest_rows

print(df)

    w   x   y   z nearest_row
a   9  25  68  88           e
b  80  49  11  95           i
c  53  99  54  67           i
d  99  15  35  25           g
e  16  61  59  17           j
f  10  94  87   3           e
g  28   5  32   2           e
h  14  84   5  92           i
i  60  68   8  50           b
j  48  66  62  15           e

In [ ]:
# 6. Create a Dataframe with rows as strides from a given series: L = pd.Series(range(15))         [8 points]

In [27]:
L = pd.Series(range(15))

def strides(a, stride_len=5, window_len=5):
    n_strides = ((a.size-window_len)//stride_len) + 1
    return np.array([a.iloc[s:(s+window_len)].values for s in np.arange(0, a.size, stride_len)[:n_strides]])

strides(L, stride_len=2, window_len=4)

array([[ 0,  1,  2,  3],
       [ 2,  3,  4,  5],
       [ 4,  5,  6,  7],
       [ 6,  7,  8,  9],
       [ 8,  9, 10, 11],
       [10, 11, 12, 13]], dtype=int64)

In [ ]:
# 7. (1) Create a DataFrame, the name of columns is abcde respectively, the values ranges [0,20).      [2 points]

In [41]:
df = pd.DataFrame(np.random.randint(0, 20, size=(5, 5)), columns=list('abcde'))
print(df)

    a   b   c   d   e
0  13   3  16  12  18
1  13  12   3  10   8
2   8  12  18  12   0
3   9   8   2  16   5
4  19   2   3  14  13

In [ ]:
# (2) Interchange columns 'a' and 'c'.      [2 points]

In [32]:
df = df[['c', 'b', 'a', 'd', 'e']]
print(df)

    c   b   a   d   e
0  14  19   8   0  13
1   3  10  12   6   3
2  15  10  15   3   9
3   4  11  16   5   7
4  10   2   6  18  13

In [ ]:
# (3) Create a generic function to interchange arbitrary two columns [6 points].

In [37]:
def swap(df, c1, c2):
    df[c1], df[c2] = df[c2], df[c1]
    return df

print('Original df values:')
print(df)
print('Swapped Values')
df = swap(df, 'a', 'b')
print(df)

Original df values:
    c   b   a   d   e
0  14   8  19  13   0
1   3  12  10   3   6
2  15  15  10   9   3
3   4  16  11   7   5
4  10   6   2  13  18
Swapped Values
    c   b   a   d   e
0  14  19   8  13   0
1   3  10  12   3   6
2  15  10  15   9   3
3   4  11  16   7   5
4  10   2   6  13  18

In [60]:
# (4) Sort the columns in reverse alphabetical order, that is column 'e' first through column 'a' last.     [2 points]

In [42]:
df = df[sorted(df.columns, reverse=True)]
print(df)

    e   d   c   b   a
0  18  12  16   3  13
1   8  10   3  12  13
2   0  12  18  12   8
3   5  16   2   8   9
4  13  14   3   2  19

In [ ]:
# 8. (1) Create a df, for the values [0,100) with a seed 1, its shape is (8,10).       [2 points]

In [43]:
np.random.seed(1)
df = pd.DataFrame(np.random.randint(0, 100, size=(8, 10)))
print(df)

    0   1   2   3   4   5   6   7   8   9
0  37  12  72   9  75   5  79  64  16   1
1  76  71   6  25  50  20  18  84  11  28
2  29  14  50  68  87  87  94  96  86  13
3   9   7  63  61  22  57   1   0  60  81
4   8  88  13  47  72  30  71   3  70  21
5  49  57   3  68  24  43  76  26  52  80
6  41  82  15  64  68  25  98  87   7  26
7  25  22   9  67  23  27  37  57  83  38

In [ ]:
# (2) Create a new column with the name 'largest2nd', 
# which has the second largest value of each row of df.        [6 points]

In [44]:
def secondlarge(row):
    sortedrow = sorted(row, reverse=True)
    return sortedrow[1]

df['largest2nd'] = df.apply(secondlarge, axis=1)

print(df)

    0   1   2   3   4   5   6   7   8   9  largest2nd
0  37  12  72   9  75   5  79  64  16   1          75
1  76  71   6  25  50  20  18  84  11  28          76
2  29  14  50  68  87  87  94  96  86  13          94
3   9   7  63  61  22  57   1   0  60  81          63
4   8  88  13  47  72  30  71   3  70  21          72
5  49  57   3  68  24  43  76  26  52  80          76
6  41  82  15  64  68  25  98  87   7  26          87
7  25  22   9  67  23  27  37  57  83  38          67

In [ ]:
# 9. For the same df created in Question8-(1), use Pandas ufuncs to normalize all columns of df 
# by subtracting the column mean and divide by standard deviation and keep the result (float) within 
# two decimal places.         [4 points]

In [45]:
np.random.seed(1)
df = pd.DataFrame(np.random.randint(0, 100, size=(8, 10)))
print(df)

normalize = (df - df.mean()) / df.std()
normalize = normalize.round(2)

print(normalize)

    0   1   2   3   4   5   6   7   8   9
0  37  12  72   9  75   5  79  64  16   1
1  76  71   6  25  50  20  18  84  11  28
2  29  14  50  68  87  87  94  96  86  13
3   9   7  63  61  22  57   1   0  60  81
4   8  88  13  47  72  30  71   3  70  21
5  49  57   3  68  24  43  76  26  52  80
6  41  82  15  64  68  25  98  87   7  26
7  25  22   9  67  23  27  37  57  83  38
      0     1     2     3     4     5     6     7     8     9
0  0.12 -0.95  1.54 -1.87  0.84 -1.25  0.55  0.31 -0.99 -1.18
1  1.88  0.79 -0.82 -1.16 -0.10 -0.66 -1.14  0.84 -1.14 -0.27
2 -0.24 -0.89  0.75  0.75  1.29  1.97  0.96  1.15  1.17 -0.78
3 -1.14 -1.09  1.22  0.44 -1.15  0.80 -1.61 -1.37  0.37  1.52
4 -1.18  1.29 -0.57 -0.18  0.73 -0.27  0.33 -1.29  0.67 -0.51
5  0.66  0.38 -0.92  0.75 -1.08  0.25  0.46 -0.69  0.12  1.49
6  0.30  1.12 -0.49  0.57  0.58 -0.46  1.07  0.92 -1.27 -0.34
7 -0.42 -0.65 -0.71  0.70 -1.12 -0.38 -0.62  0.13  1.07  0.07

In [ ]:
# 10. For the same df created in Question8-(1), 
# compute the correlation of each row of df with its succeeding row.   [6 points]

In [50]:
np.random.seed(1)
df = pd.DataFrame(np.random.randint(0, 100, size=(8, 10)))
print(df)

corr_values = df.corrwith(df.shift(-1), axis=1).dropna()
print(corr_values)

    0   1   2   3   4   5   6   7   8   9
0  37  12  72   9  75   5  79  64  16   1
1  76  71   6  25  50  20  18  84  11  28
2  29  14  50  68  87  87  94  96  86  13
3   9   7  63  61  22  57   1   0  60  81
4   8  88  13  47  72  30  71   3  70  21
5  49  57   3  68  24  43  76  26  52  80
6  41  82  15  64  68  25  98  87   7  26
7  25  22   9  67  23  27  37  57  83  38
0    0.093043
1   -0.221440
2   -0.181497
3   -0.186845
4    0.324428
5    0.197334
6   -0.038168
dtype: float64

In [ ]:
# 11. Two DataFrames, df1, df2 are given as below. Join df1 and df2 by ‘fruit1-fruit2’ and 
# ‘weight-pounds’; 'price' in left and right DataFrames will be kept in an appropriate way. [4 points]

In [60]:
df1 = pd.DataFrame({'fruit1': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price1': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'fruit2': ['apple', 'orange', 'pine'] * 2,
                    'pounds': ['high', 'low'] * 3,
                    'price2': np.random.randint(0, 15, 6)})


merged_df = pd.merge(df1, df2, left_on=['fruit1', 'weight'], right_on=['fruit2', 'pounds'])
print(merged_df)
print('')
# dropping the redundant 'fruit2' and 'pounds' columns
merged_df = merged_df.drop(columns=['fruit2', 'pounds'])
print(merged_df)

   fruit1 weight  price1  fruit2 pounds  price2
0   apple   high      13   apple   high       7
1   apple   high       0   apple   high       7
2   apple   high       0   apple   high       7
3  orange    low       9  orange    low      12
4  orange    low       2  orange    low      12
5  orange    low      10  orange    low      12

   fruit1 weight  price1  price2
0   apple   high      13       7
1   apple   high       0       7
2   apple   high       0       7
3  orange    low       9      12
4  orange    low       2      12
5  orange    low      10      12

In [ ]:
# 12. (1) Create a df, for the values [0,10) with a seed 10, its shape is (6,6).    [2 points]

In [61]:
np.random.seed(10)
df = pd.DataFrame(np.random.randint(0, 10, size=(6, 6)))
print(df)

   0  1  2  3  4  5
0  9  4  0  1  9  0
1  1  8  9  0  8  6
2  4  3  0  4  6  8
3  1  8  4  1  3  6
4  5  3  9  6  9  1
5  9  4  2  6  7  8

In [62]:
# (2) Use 0 to replace the values on both diagonals of this dataframe.       [4 points]

In [63]:
for i in range(6):
    df.iloc[i, i] = 0
    df.iloc[i, 5-i] = 0

print(df)

   0  1  2  3  4  5
0  0  4  0  1  9  0
1  1  0  9  0  0  6
2  4  3  0  0  6  8
3  1  8  0  0  3  6
4  5  0  9  6  0  1
5  0  4  2  6  7  0

In [121]:
# 13. (1) Read data from the file 'users.txt' and use the 'user_id' as index name.  [2 points]

In [7]:
file_path = "/Users/Samhitha/Downloads/users.txt"
df = pd.read_csv(file_path, delimiter='|')
df = df.set_index('user_id')
print(df)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [67]:
# (2) See the first 10 entries.   [2 points]

In [8]:
df[:10]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [ ]:
# (3) Output the name of all the columns.    [2 points]

In [151]:
print(df.columns)

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [ ]:
# (4) Output the data type of each column.   [2 points]

In [153]:
print(df.dtypes)

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [ ]:
# (5) Output only the 'occupation' column.   [2 points]

In [132]:
df['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [ ]:
# (6) Find how many different occupations are in this dataset.  [3 points]

In [135]:
occupationtotal = df['occupation'].nunique()
print(occupationtotal)

21

In [ ]:
# (7) Summarize the 'occupation' column by describe().    [2 points]

In [154]:
print(df['occupation'].describe())

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [ ]:
# (8) Calculate the mean age of users and return an integer number.  [2 points]

In [156]:
mean_age = int(df['age'].mean())
print(mean_age)

34

In [ ]:
# (9) List the age with the least occurrence. [3 points]

In [157]:
df['age'].value_counts().sort_values().index[0]

73